benchmarks/results/benchmark_20260328_173418.raw.log
==================================================
Benchmark Mercury Server (http://127.0.0.1:18110/health)
Threads=4 Connections=64 Duration=8s Warmup=3s Rounds=2
Warmup 3s...
Running 3s test @ http://127.0.0.1:18110/health
  4 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.74ms  392.52us   8.31ms   85.81%
    Req/Sec     8.79k     1.05k   10.68k    59.68%
  Latency Distribution
     50%    1.64ms
     75%    1.95ms
     90%    2.12ms
     99%    2.93ms
  108438 requests in 3.10s, 13.34MB read
Requests/sec:  34978.89
Transfer/sec:      4.30MB

Rodada 1/2
Running 8s test @ http://127.0.0.1:18110/health
  4 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.77ms  424.98us  14.57ms   89.15%
    Req/Sec     8.62k     1.06k   13.11k    70.90%
  Latency Distribution
     50%    1.68ms
     75%    1.97ms
     90%    2.13ms
     99%    2.77ms
  277136 requests in 8.10s, 34.09MB read
Requests/sec:  34215.83
Transfer/sec:      4.21MB

Rodada 2/2
Running 8s test @ http://127.0.0.1:18110/health
  4 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.74ms  403.62us  14.79ms   86.54%
    Req/Sec     8.83k     1.27k   12.73k    71.56%
  Latency Distribution
     50%    1.62ms
     75%    1.98ms
     90%    2.13ms
     99%    2.69ms
  281064 requests in 8.01s, 34.58MB read
Requests/sec:  35074.18
Transfer/sec:      4.31MB

==================================================
Benchmark Go (http://127.0.0.1:18111/health)
Threads=4 Connections=64 Duration=8s Warmup=3s Rounds=2
Warmup 3s...
Running 3s test @ http://127.0.0.1:18111/health
  4 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   612.90us  823.79us  14.54ms   86.89%
    Req/Sec    38.04k     6.34k   64.60k    84.55%
  Latency Distribution
     50%  234.00us
     75%  802.00us
     90%    1.67ms
     99%    3.71ms
  465336 requests in 3.10s, 54.58MB read
Requests/sec: 150005.95
Transfer/sec:     17.60MB

Rodada 1/2
Running 8s test @ http://127.0.0.1:18111/health
  4 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   622.14us  798.83us  11.98ms   86.24%
    Req/Sec    36.77k     3.35k   44.91k    81.25%
  Latency Distribution
     50%  240.00us
     75%  832.00us
     90%    1.70ms
     99%    3.61ms
  1171211 requests in 8.01s, 137.39MB read
Requests/sec: 146158.06
Transfer/sec:     17.14MB

Rodada 2/2
Running 8s test @ http://127.0.0.1:18111/health
  4 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   632.84us  821.00us  12.69ms   86.34%
    Req/Sec    36.33k     3.62k   49.32k    74.69%
  Latency Distribution
     50%  241.00us
     75%  847.00us
     90%    1.73ms
     99%    3.67ms
  1157769 requests in 8.02s, 135.81MB read
Requests/sec: 144428.69
Transfer/sec:     16.94MB

==================================================
Benchmark Node (http://127.0.0.1:18112/health)
Threads=4 Connections=64 Duration=8s Warmup=3s Rounds=2
Warmup 3s...
Running 3s test @ http://127.0.0.1:18112/health
  4 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.71ms    6.91ms 125.85ms   98.38%
    Req/Sec    17.04k     4.33k   26.89k    81.30%
  Latency Distribution
     50%  792.00us
     75%    0.96ms
     90%    1.62ms
     99%   30.75ms
  208539 requests in 3.10s, 37.39MB read
Requests/sec:  67271.17
Transfer/sec:     12.06MB

Rodada 1/2
Running 8s test @ http://127.0.0.1:18112/health
  4 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.91ms  832.40us  38.67ms   95.70%
    Req/Sec    18.78k     4.13k   79.83k    93.46%
  Latency Distribution
     50%  773.00us
     75%    0.87ms
     90%    1.15ms
     99%    2.55ms
  599697 requests in 8.10s, 107.52MB read
Requests/sec:  74034.66
Transfer/sec:     13.27MB

Rodada 2/2
Running 8s test @ http://127.0.0.1:18112/health
  4 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.89ms  714.21us  33.21ms   94.42%
    Req/Sec    18.94k     3.69k   69.05k    90.97%
  Latency Distribution
     50%  767.00us
     75%  842.00us
     90%    1.15ms
     99%    2.49ms
  604963 requests in 8.10s, 108.46MB read
Requests/sec:  74688.85
Transfer/sec:     13.39MB