benchmarks/results/wrk_with_metrics_20260328_172023.log
Running 10s test @ http://127.0.0.1:18090/health
  8 threads and 128 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.99ms  768.29us  12.61ms   74.91%
    Req/Sec     3.93k   585.63     6.03k    75.88%
  Latency Distribution
     50%    4.21ms
     75%    4.46ms
     90%    4.72ms
     99%    5.99ms
  312661 requests in 10.00s, 38.46MB read
Requests/sec:  31250.48
Transfer/sec:      3.84MB