benchmarks/results/wrk_with_metrics_20260328_172612.log
Running 10s test @ http://127.0.0.1:18100/health
  8 threads and 128 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.66ms  580.59us  11.05ms   76.03%
    Req/Sec     4.29k   498.37     5.42k    65.12%
  Latency Distribution
     50%    3.53ms
     75%    4.07ms
     90%    4.36ms
     99%    5.07ms
  341653 requests in 10.01s, 42.03MB read
Requests/sec:  34147.25
Transfer/sec:      4.20MB